app/views/shared/advertisements/_advertisement_card.erb

    <%
      valid_pictures = advertisement.advertisement_pictures.select { |pic| pic.image.attached? }
---
SELECT "advertisements".* FROM "advertisements" WHERE "advertisements"."ad_id" = 9 LIMIT 1
SELECT "advertisement_pictures".* FROM "advertisement_pictures" WHERE "advertisement_pictures"."ad_id" = 9

                    alt: advertisement.title %>
    <% elsif advertisement.advertisement_pictures.any? %>
---
SELECT 1 AS one FROM "advertisements" LIMIT 1 OFFSET 0
SELECT 1 AS one FROM "advertisement_pictures" WHERE "advertisement_pictures"."ad_id" = 6 LIMIT 1