app/views/advertisements/_filters.erb

          <div class="w-full">
            <%= f.select :city_id,
                         options_for_select([["Любой", ""]] + (City.all.map { |c| [c.name, c.id] }), params[:city_id]),
                         {},
                         class: "w-full px-3 py-2 border border-gray-300 rounded-lg focus:ring-2 focus:ring-blue-500 focus:border-blue-500" %>
---
SELECT "cities".* FROM "cities"