app/views/advertisements/edit.html.erb

SELECT "cities".* FROM "cities"
---
          <%= form.label :city_id, "Город", class: "block text-sm font-medium text-gray-700" %>
          <%= form.select :city_id,
                          options_for_select(@cities.map { |city| [city.name, city.city_id] }, @advertisement.city_id),
                          { include_blank: "Выберите город..." },
                          class: "mt-1 block w-full pl-3 pr-10 py-2 text-base border border-gray-300 focus:outline-none focus:ring-blue-500 focus:border-blue-500 sm:text-sm rounded-md",
                          required: true %>

SELECT "advertisement_pictures".* FROM "advertisement_pictures" WHERE "advertisement_pictures"."ad_id" = 10
SELECT "advertisements".* FROM "advertisements" WHERE "advertisements"."ad_id" = 2 LIMIT 1
SELECT 1 AS one FROM "advertisement_pictures" WHERE "advertisement_pictures"."ad_id" = 10 LIMIT 1
---
        <!-- Существующие фотографии -->
        <% if @advertisement.persisted? && @advertisement.advertisement_pictures.any? %>

SELECT "advertisement_pictures".* FROM "advertisement_pictures" WHERE "advertisement_pictures"."ad_id" = 10
---
            <div class="grid grid-cols-2 sm:grid-cols-3 md:grid-cols-4 gap-3">
              <% @advertisement.advertisement_pictures.each do |picture| %>