app/views/advertisements/my.html.erb


              <% if ad.chats.any? %>
---
SELECT "chats".* FROM "chats" WHERE "chats"."advertisement_id" = 11