app/views/advertisements/new.html.erb

SELECT "cities".* FROM "cities"
---
          <%= form.label :city_id, "Город", class: "block text-sm font-medium text-gray-700" %>
          <%= form.select :city_id,
                          options_for_select(@cities.map { |city| [city.name, city.city_id] }, @advertisement.city_id),
                          { include_blank: "Выберите город..." },
                          class: "mt-1 block w-full pl-3 pr-10 py-2 text-base border border-gray-300 focus:outline-none focus:ring-blue-500 focus:border-blue-500 sm:text-sm rounded-md",
                          required: true %>