app/views/advertisements/show.html.erb

        <!-- Фотографии объявления -->
        <% if @advertisement.advertisement_pictures.any? %>
---
SELECT "advertisements".* FROM "advertisements" WHERE "advertisements"."ad_id" = 4 LIMIT 1
SELECT "advertisement_pictures".* FROM "advertisement_pictures" WHERE "advertisement_pictures"."ad_id" = 10
SELECT 1 AS one FROM "advertisement_pictures" WHERE "advertisement_pictures"."ad_id" = 12 LIMIT 1

            <div class="grid grid-cols-4 sm:grid-cols-6 md:grid-cols-8 gap-2">
              <% @advertisement.advertisement_pictures.order(:position).each_with_index do |picture, index| %>
---
SELECT "advertisement_pictures".* FROM "advertisement_pictures" WHERE "advertisement_pictures"."ad_id" = 10 ORDER BY "advertisement_pictures"."position" ASC LIMIT 1

            <div class="mt-3 text-sm text-gray-500">
              Всего фотографий: <%= @advertisement.advertisement_pictures.count %>
---
SELECT COUNT(*) FROM "advertisement_pictures" WHERE "advertisement_pictures"."ad_id" = 7

        <!-- Чаты объявления -->
        <% if current_user == @advertisement.user && @advertisement.chats.any? %>
---
SELECT "chats".* FROM "chats" WHERE "chats"."advertisement_id" = 12
SELECT "users".* FROM "users" WHERE "users"."id" = 1 LIMIT 1
SELECT 1 AS one FROM "chats" WHERE "chats"."advertisement_id" = 12 LIMIT 1

            <div class="space-y-3">
              <% @advertisement.chats.includes(:user).each do |chat| %>
---
SELECT "chats".* FROM "chats" WHERE "chats"."advertisement_id" = 12
SELECT "users".* FROM "users" WHERE "users"."id" IN (2, 4)

<!-- JavaScript для галереи (можно вынести в отдельный файл) -->
<% if @advertisement.advertisement_pictures.any? %>
  <script>
      document.addEventListener('DOMContentLoaded', function() {
          const images = <%= @advertisement.advertisement_pictures.order(:position)
                         .select { |p| p.image.attached? }
                         .map { |p| rails_blob_path(p.image) }.to_json.html_safe %>;

          if (images.length > 0) {
              const mainImage = document.getElementById('main-image');
              const thumbnails = document.querySelectorAll('[data-action="click->gallery#changeImage"]');

              thumbnails.forEach((thumbnail, index) => {
                  thumbnail.addEventListener('click', function() {
                      // Меняем основное изображение
                      mainImage.src = images[index];

                      // Убираем выделение со всех миниатюр
                      thumbnails.forEach(thumb => {
                          thumb.querySelector('div').classList.remove('border-blue-500');
                          thumb.querySelector('div').classList.add('border-transparent');
                      });

                      // Добавляем выделение текущей миниатюре
---
SELECT 1 AS one FROM "advertisement_pictures" WHERE "advertisement_pictures"."ad_id" = 12 LIMIT 1
SELECT "advertisement_pictures".* FROM "advertisement_pictures" WHERE "advertisement_pictures"."ad_id" = 10 ORDER BY "advertisement_pictures"."position" ASC