app/views/advertisements/show.html.erb

<!-- JavaScript для галереи (можно вынести в отдельный файл) -->
<% if @advertisement.advertisement_pictures.any? %>
---
SELECT 1 AS one FROM "advertisement_pictures" WHERE "advertisement_pictures"."ad_id" = 7 LIMIT 1

      document.addEventListener('DOMContentLoaded', function() {
          const images = <%= @advertisement.advertisement_pictures.order(:position)
                         .select { |p| p.image.attached? }
                         .map { |p| rails_blob_path(p.image) }.to_json.html_safe %>;
---
SELECT "advertisement_pictures".* FROM "advertisement_pictures" WHERE "advertisement_pictures"."ad_id" = 7 ORDER BY "advertisement_pictures"."position" ASC