app/controllers/advertisements_controller.rb

  def new
    @advertisement = current_user.advertisements.new
    @categories = Advertisement::CATEGORIES
    @cities = City.all
---
SELECT "cities".* FROM "cities"

  def index
    @cities = City.all
    scope = Advertisement.includes(:user, :city).all
---
SELECT "cities".* FROM "cities" WHERE "cities"."city_id" IN (4, 1, 2, 5)
SELECT "advertisements".* FROM "advertisements" WHERE "advertisements"."ad_id" = 9 LIMIT 1
SELECT "users".* FROM "users" WHERE "users"."id" IN (2, 1)
SELECT "cities".* FROM "cities" WHERE "cities"."city_id" = 1 LIMIT 1

  def create
    all_params = params.require(:advertisement).to_unsafe_h

    ad_params = all_params.slice(
      'title', 'description', 'price', 'status',
      'category_id', 'city_id'
    )

    @advertisement = Advertisement.new(ad_params)
    @advertisement.user_id = current_user.id

    if @advertisement.category_id.present?
      category_params = extract_category_params(@advertisement.category_id, all_params)
      @advertisement.build_category_detail(category_params)
    end

    ActiveRecord::Base.transaction do
      if @advertisement.save
        if @advertisement.category_detail&.save
          # Загрузка фотографий
          if params[:advertisement][:pictures].present?
            params[:advertisement][:pictures].each_with_index do |photo, index|
              @advertisement.advertisement_pictures.create(
                image: photo,
                position: index + 1
              )
---
SELECT "advertisements".* FROM "advertisements" WHERE "advertisements"."ad_id" = 4 LIMIT 1
INSERT INTO "advertisements" ("user_id", "city_id", "category_id", "status", "price", "title", "description", "created_at", "updated_at") VALUES (1, 4, 1, 'active', 123123.0, '333', '333', '2025-12-20 18:58:18.663359', '2025-12-20 18:58:18.663359') RETURNING "ad_id"
SELECT "advertisements".* FROM "advertisements" WHERE "advertisements"."ad_id" = 8 LIMIT 1
INSERT INTO "advertisement_pictures" ("ad_id", "position", "created_at", "updated_at") VALUES (8, 1, '2025-12-20 20:19:49.893254', '2025-12-20 20:19:49.893254') RETURNING "id"

    end

    @categories = Advertisement::CATEGORIES
    @cities = City.all
---
SELECT "cities".* FROM "cities" WHERE "cities"."city_id" = 1 LIMIT 1

  def edit
    @categories = Advertisement::CATEGORIES
    @cities = City.all
---
SELECT "cities".* FROM "cities"

  def update
    all_params = params.require(:advertisement).to_unsafe_h

    ad_params = all_params.slice(
      'title', 'description', 'price', 'status',
      'category_id', 'city_id'
    )

    ActiveRecord::Base.transaction do
      if @advertisement.update(ad_params)
        category_params = extract_category_params(@advertisement.category_id, all_params)

        if @advertisement.category_detail
          @advertisement.category_detail.update(category_params)
        else
          @advertisement.build_category_detail(category_params)
          @advertisement.category_detail.save
        end

        # Добавление новых фотографий
        if params[:advertisement][:pictures].present?
          last_position = @advertisement.advertisement_pictures.maximum(:position) || 0
          params[:advertisement][:pictures].each_with_index do |photo, index|
            @advertisement.advertisement_pictures.create(
              image: photo,
              position: last_position + index + 1
            )
---
UPDATE "advertisements" SET "description" = 'В отличном состоянии, двигателя коробки нет', "updated_at" = '2025-12-20 21:50:39.888454' WHERE "advertisements"."ad_id" = 1
SELECT "advertisements".* FROM "advertisements" WHERE "advertisements"."ad_id" = 10 LIMIT 1
SELECT MAX("advertisement_pictures"."position") FROM "advertisement_pictures" WHERE "advertisement_pictures"."ad_id" = 10
SELECT "advertisements".* FROM "advertisements" WHERE "advertisements"."ad_id" = 2 LIMIT 1
INSERT INTO "advertisement_pictures" ("ad_id", "position", "created_at", "updated_at") VALUES (10, 4, '2025-12-20 21:27:01.482458', '2025-12-20 21:27:01.482458') RETURNING "id"

        # Удаление отмеченных фотографий
        if params[:advertisement][:delete_photos].present?
          params[:advertisement][:delete_photos].each do |photo_id|
            photo = @advertisement.advertisement_pictures.find_by(id: photo_id)
---
SELECT "advertisement_pictures".* FROM "advertisement_pictures" WHERE "advertisement_pictures"."ad_id" = 9
SELECT "advertisements".* FROM "advertisements" WHERE "advertisements"."ad_id" = 2 LIMIT 1

  def destroy
    @advertisement.destroy
---
DELETE FROM "advertisements" WHERE "advertisements"."ad_id" = 9

  def my
    @advertisements = Advertisement.where(user_id: current_user.id)
                                   .includes(:chats)
                                   .order(created_at: :desc)
---
SELECT "advertisements".* FROM "advertisements" WHERE "advertisements"."user_id" = 1 ORDER BY "advertisements"."created_at" DESC

  def set_advertisement
    @advertisement = Advertisement.find(params[:id])
---
SELECT "advertisements".* FROM "advertisements" WHERE "advertisements"."ad_id" = 11 LIMIT 1