app/controllers/advertisements_controller.rb

  def create
    all_params = params.require(:advertisement).to_unsafe_h

    ad_params = all_params.slice(
      'title', 'description', 'price', 'status',
      'category_id', 'city_id'
    )

    @advertisement = Advertisement.new(ad_params)
    @advertisement.user_id = current_user.id

    if @advertisement.category_id.present?
      category_params = extract_category_params(@advertisement.category_id, all_params)
      @advertisement.build_category_detail(category_params)
    end

    ActiveRecord::Base.transaction do
      if @advertisement.save
        if @advertisement.category_detail&.save
          redirect_to my_advertisements_path, notice: 'Объявление успешно создано!'
          return
        else
          raise ActiveRecord::Rollback
        end
      else
        raise ActiveRecord::Rollback
      end
    end

    @categories = Advertisement::CATEGORIES
    @cities = City.all
---
INSERT INTO "advertisements" ("user_id", "city_id", "category_id", "status", "price", "title", "description", "created_at", "updated_at") VALUES (1, 5, 2, 'active', 15000.0, 'Сдам халупу в Койсуге', 'Сдам короче хату жены, жене она больше не нужна.', '2025-12-19 20:40:01.013625', '2025-12-19 20:40:01.013625') RETURNING "ad_id"
SELECT "cities".* FROM "cities" WHERE "cities"."city_id" = 2 LIMIT 1

  def edit
    @categories = Advertisement::CATEGORIES
    @cities = City.all
---
SELECT "cities".* FROM "cities" WHERE "cities"."city_id" = 4 LIMIT 1

  def update
    all_params = params.require(:advertisement).to_unsafe_h

    ad_params = all_params.slice(
      'title', 'description', 'price', 'status',
      'category_id', 'city_id'
    )

    ActiveRecord::Base.transaction do
      if @advertisement.update(ad_params)
---
UPDATE "advertisements" SET "price" = 500000.0, "title" = 'Сарай в Сочи', "description" = 'Сарай под свиней', "updated_at" = '2025-12-20 08:25:31.949119' WHERE "advertisements"."ad_id" = 2