app/controllers/chats_controller.rb

  def show
    @messages = @chat.messages.includes(:sender, :receiver).order(:created_at)
---
SELECT "messages".* FROM "messages" WHERE "messages"."chat_id" = 1 ORDER BY "messages"."created_at" ASC

  def create
    @chat = Chat.find_or_initialize_by(
      advertisement: @advertisement,
      ad_owner: @advertisement.user,
      user: current_user
    )
    if @chat.new_record?
      @chat.created_time = Time.now
---
SELECT "chats".* FROM "chats" WHERE "chats"."advertisement_id" = 11 AND "chats"."ad_owner_id" = 3 AND "chats"."user_id" = 2 LIMIT 1
SELECT "users".* FROM "users" WHERE "users"."id" = 3 LIMIT 1
INSERT INTO "chats" ("advertisement_id", "ad_owner_id", "user_id", "created_time", "created_at", "updated_at") VALUES (11, 3, 2, '2025-12-21 16:54:48.967912', '2025-12-21 16:54:48.968578', '2025-12-21 16:54:48.968578') RETURNING "id"

  def set_advertisement
    @advertisement = Advertisement.find_by(ad_id: params[:advertisement_id] || params.dig(:chat, :advertisement_id))
---
SELECT "advertisements".* FROM "advertisements" WHERE "advertisements"."ad_id" IS NULL LIMIT 1

  def set_chat
    @chat = Chat.find(params[:id])
---
SELECT "chats".* FROM "chats" WHERE "chats"."id" = 1 LIMIT 1