app/controllers/messages_controller.rb

  def create
    @message = @chat.messages.new(message_params)
    @message.sender = current_user
    @message.receiver = (@chat.ad_owner == current_user) ? @chat.user : @chat.ad_owner

    if @message.save
---
INSERT INTO "messages" ("chat_id", "sender_id", "receiver_id", "text", "created_at", "updated_at") VALUES (1, 2, 3, 'рпарап', '2025-12-21 17:04:23.187399', '2025-12-21 17:04:23.187399') RETURNING "id"

  def set_chat
    @chat = Chat.find(params[:chat_id])
---
SELECT "chats".* FROM "chats" WHERE "chats"."id" = 1 LIMIT 1