app/controllers/users_controller.rb

SELECT "cities".* FROM "cities" ORDER BY "cities"."city_id" ASC LIMIT 1
INSERT INTO "users" ("city_id", "email", "password_digest", "username", "phone", "rating", "created_at", "updated_at") VALUES (1, 'guffy911d@gmail.com', '$2a$12$lGPNBVJjGrZ9Bekjm96u3uj.LMqYMcWlfRV05pZohDMk19A82s52S', 'guffy', NULL, NULL, '2025-12-09 19:48:24.649751', '2025-12-09 19:48:24.649751') RETURNING "id"
---
  def create
    @user = User.new(user_params)
    @user.city_id ||= City.first&.id || 1
    if @user.save