app/models/advertisement.rb

  def ad_type
    case
      when transport_detail.present? then 'transport'
      when real_estate_detail.present? then 'real_estate'
      when service_detail.present? then 'service'
      when thing_detail.present? then 'thing'
---
SELECT "transports".* FROM "transports" WHERE "transports"."advertisement_id" = 7 LIMIT 1
SELECT "real_estates".* FROM "real_estates" WHERE "real_estates"."advertisement_id" = 2 LIMIT 1
SELECT "things".* FROM "things" WHERE "things"."advertisement_id" = 11 LIMIT 1